#ifndef DATA_STRUCTURE_H // Проверка: ако този файл все още не е четен от компилатора
#define DATA_STRUCTURE_H // Маркирай файла като прочетен, за да няма дублиране

#include <Arduino.h> // Включваме основните функции на Arduino

// Създаваме структура, която обединява всички наши данни в един общ пакет
struct DataPacket {
  char err[10][20]; // Масив от 10 текстови съобщения, всяко с максимална дължина 19 символа + 1 за край (\0)
  int temp[10];     // Масив от 10 цели числа (напр. температури)
  uint16_t crc;     // 2 байта (16 бита) в края, където ще пазим CRC контролната сума
};

#endif // Край на проверката за дублиране
